In [2]:
import numpy as np
import pandas as pd

In [3]:
# 创建随机数生成器
rng = np.random.default_rng(seed=1234)

# 7.1 处理缺失值，哨兵值

In [4]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = pd.Series(['aardvark', np.nan, None, 'avocado'])

string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [7]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
float_data = pd.DataFrame(rng.standard_normal((3,3)), 
                          dtype='float64', 
                          columns=['a', 'b', 'c'])

float_data

          a         b         c
0 -1.603837  0.064100  0.740891
1  0.152619  0.863744  2.913099
2 -1.478823  0.945473 -1.666135

In [9]:
float_data.iloc[:2, 2] = np.nan
float_data.isna()

       a      b      c
0  False  False   True
1  False  False   True
2  False  False  False

In [10]:
float_data.loc[[0,2] , ['a', 'b']] = np.nan # loc() 根据标签索引
float_data.isna()

       a      b      c
0   True   True   True
1  False  False   True
2   True   True  False

## 过滤缺失值

In [11]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

data.dropna() # 过滤缺失值

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notna()] # =data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
dataf = pd.DataFrame(rng.standard_normal((4,3)))
dataf.iloc[1:3, 1:] = np.nan
dataf.iloc[2:, 0] =np.nan
dataf

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
2       NaN       NaN       NaN
3       NaN -1.002166  0.268346

In [14]:
dataf.dropna()

          0         1         2
0  0.343745 -0.512444  1.323759

In [15]:
dataf.dropna(how='all')
#    - `'any'` (默认)："零容忍"策略 - 确保每个保留的观测都是完整的
#   - `'all'`："最大限度保留"策略 - 只删除完全没有信息的行/列

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
3       NaN -1.002166  0.268346

In [16]:
dataf[4] = np.nan
dataf

          0         1         2   4
0  0.343745 -0.512444  1.323759 NaN
1 -0.860280       NaN       NaN NaN
2       NaN       NaN       NaN NaN
3       NaN -1.002166  0.268346 NaN

In [17]:
dataf.dropna(axis='columns', how='all')

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
2       NaN       NaN       NaN
3       NaN -1.002166  0.268346

In [18]:
df = pd.DataFrame(rng.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

df

          0         1         2
0  0.767175       NaN       NaN
1  0.696279       NaN       NaN
2  0.013182       NaN -0.620532
3  1.331214       NaN -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

In [19]:
df.dropna()

          0         1         2
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

In [20]:
df.dropna(thresh=2) # threshold = 2 设置一个阈值

          0         1         2
2  0.013182       NaN -0.620532
3  1.331214       NaN -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

## 补充缺失值

In [21]:
df.fillna(0)

          0         1         2
0  0.767175  0.000000  0.000000
1  0.696279  0.000000  0.000000
2  0.013182  0.000000 -0.620532
3  1.331214  0.000000 -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

用字典调用 `fillna` 时，你可以为每列使用不同的填充值：

In [22]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.767175  0.500000  0.000000
1  0.696279  0.500000  0.000000
2  0.013182  0.500000 -0.620532
3  1.331214  0.500000 -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

用于`.reindex()`的插值方法（见表 5.3）也可以用于 `fillna`：

In [23]:
df = pd.DataFrame(rng.standard_normal((6,3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan

df

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090       NaN -0.221804
3  0.648817       NaN -0.010978
4  1.665417       NaN       NaN
5  2.799627       NaN       NaN

In [24]:
df.fillna(method='ffill') # 将过时

/var/folders/1m/2jsf455s4r7dx9t8l233n55c0000gp/T/ipykernel_21863/279806938.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill') # 将过时

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325 -0.010978
5  2.799627 -0.487325 -0.010978

In [25]:
df.ffill()

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325 -0.010978
5  2.799627 -0.487325 -0.010978

In [26]:
df.ffill(limit=1) # 填充数 = limit value

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817       NaN -0.010978
4  1.665417       NaN -0.010978
5  2.799627       NaN       NaN

In [27]:
print('dataframe 切片成 Series：')
print(df.median())
print(df.median().shape)
print('-------')
print('Series 按广播机制默认匹配 dataframe 的 colums => col1 = 1.458275， col2 = 1.247230')
print(df.fillna(df.median())) # 默认 axis =0

dataframe 切片成 Series：
0    1.119464
1    0.313741
2   -0.864106
dtype: float64
(3,)
-------
Series 按广播机制默认匹配 dataframe 的 colums => col1 = 1.458275， col2 = 1.247230
          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090  0.313741 -0.221804
3  0.648817  0.313741 -0.010978
4  1.665417  0.313741 -0.864106
5  2.799627  0.313741 -0.864106

In [28]:
print(df.median(axis=1))
print(df.median(axis=1).shape) # 压缩掉了 axis=1，剩下 shape （6， ）
print('-------')
print(df.fillna(df.median(axis=1), axis=0)) # 默认 axis=0 对齐，fillna 暂不支持 axis >0 高维运算

0   -0.299639
1   -0.487325
2    0.145643
3    0.318919
4    1.665417
5    2.799627
dtype: float64
(6,)
-------
          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325  0.145643
5  2.799627 -0.487325  0.145643

# 7.2 数据转换 data transformation

## 删除重复内容

In [29]:
data = pd.DataFrame({'k1': ['one', 'two']*3+['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated() 
# 因为row 5, 6 的 k1, k2 列相同

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
data.drop_duplicates(subset=['k1']) # 默认保留第一个观察到的值组合

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
data.drop_duplicates(subset=['k1'], keep='last') # keep="last" will return the last one

    k1  k2  v1
4  one   3   4
6  two   4   6

In [35]:
data.drop_duplicates(subset=['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

## 使用函数或映射mapping转换数据

In [36]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

### map修改值

In [ ]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

data['animal'] = data['food'].map(meat_to_animal) # 修改值

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### map映射值

In [39]:
def get_animal(x):
    return meat_to_animal[x]

get_animal('bacon')

'pig'

In [40]:
data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [ ]:
data['food'].map(lambda x: meat_to_animal[x]) # lambda函数

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 替换值

In [42]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
print(data.replace(-999, np.nan))
print('-' * 10)
print(data.replace([-999, -1000], np.nan))
print('-' * 10)
print(data.replace([-999, -1000], [np.nan, 0])) # 分别替换两个不同值

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64
----------
0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64
----------
0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
print(data.replace({-999: np.nan, -1_000: 0})) # 用 dict-like 语句传递参数
print('-' * 10)
print(f'data 值不变\n{data}\n.replace() 创建副本,不修改原视图')

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64
----------
data 值不变
0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64
.replace() 创建副本,不修改原视图

## 重命名轴标签

In [56]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
data.index.map(lambda x: x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [58]:
def upper_func(x):
    return x.upper()

data.index.map(upper_func)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [61]:
print(data)
print('data 原视图未改变')
print('-'*10)
data.index = data.index.map(upper_func)
print(data)
print('data.index 被修改')

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11
data 原视图未改变
----------
          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11
data.index 被修改

上述方法直接改变了 `data.index`

如果不想改变原视图就实现 rename，可以使用 `rename` 函数

In [65]:
data_rename = data.rename(index=str.title, columns=str.upper) # copy

data_rename

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

`rename` 省去了为 `index` `columns` 赋值的麻烦

In [66]:
data # with modifying the original

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## 离散化与分箱 Discretization and Binning

连续数据通常会被离散化或以其他方式分成“箱 bins”进行分析。

In [67]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)

age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [68]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [69]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [71]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

在区间的字符串表示中，括号表示边是开的 （排他的），而方括号表示是闭的 （包含的）。

你可以通过传递 `right =False` 来改变哪一侧是闭合的：

In [72]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [73]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

如果你把整数个 bin 传递给 `pandas.cut` 而不是显式 bin 的边，它会根据数据中的最小值和最大值计算出等长 bin。

考虑一些均匀分布的数据被切成四分之一的情况：

In [77]:
data = rng.uniform(size=20)
data_cate = pd.cut(data, 4, precision=2) # 小数点显示精度，只影响显示，不影响计算
# 第一个bin的下界是数据的最小值，最后一个 bin 的上界是数据的最大值

In [78]:
data_cate.value_counts()

(0.033, 0.26]    6
(0.26, 0.5]      5
(0.5, 0.73]      3
(0.73, 0.96]     6
Name: count, dtype: int64

`pandas.qcut` 基于样本分位数对数据进行分组处理。根据数据分布不同，使用 `pandas.cut` 通常不会让每个箱的数据点数相同。由于 `pandas.qcut` 使用样本分位数，你会得到大小大致相同的箱：

In [ ]:
data = rng.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)

quartiles

[(0.68, 4.08], (-0.6, 0.006], (0.68, 4.08], (0.006, 0.68], (0.68, 4.08], ..., (0.68, 4.08], (-0.6, 0.006], (-0.6, 0.006], (0.006, 0.68], (-0.6, 0.006]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.78, -0.6] < (-0.6, 0.006] < (0.006, 0.68] < (0.68, 4.08]]

In [80]:
quartiles.value_counts()

(-2.78, -0.6]    250
(-0.6, 0.006]    250
(0.006, 0.68]    250
(0.68, 4.08]     250
Name: count, dtype: int64

In [ ]:
  可视化分箱过程
   1 数据点分布:   1    2    3    4                      100   101   102
   2              |    |    |    |-------- 巨大间隔 -----|    |    |
   3 
   4 pd.cut (等宽): |-------箱1-------|-------箱2-------|-------箱3-------|
   5               宽度相等但点数不均   空箱              点数集中
   6 
   7 pd.qcut (等频): |-箱1-| |-箱2-| |-----------箱3------------|
   8                 ≈2个点  ≈2个点            ≈3个点

In [81]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.7689999999999997, -1.24]    100
(-1.24, 0.00601]                400
(0.00601, 1.362]                400
(1.362, 4.083]                  100
Name: count, dtype: int64

## 检测和过滤异常值 Detecting and Filtering Outliers

In [82]:
data = pd.DataFrame(rng.standard_normal((1_000,4)))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005180     0.007977    -0.000793    -0.102092
std       0.994195     0.984761     1.007387     1.003223
min      -3.299076    -2.845783    -3.088291    -3.818862
25%      -0.664155    -0.657660    -0.660373    -0.783746
50%       0.015988     0.021432     0.012209    -0.110061
75%       0.624453     0.659387     0.680037     0.553247
max       2.902788     3.335903     3.307190     3.087162

In [90]:
col2 = data[2]

col2[col2.abs() >3]

185    3.307190
524   -3.088291
610   -3.077630
816    3.072759
Name: 2, dtype: float64

要选择DataFrame中所有值大于 3 或–3 的行，可以使用 `.any`方法：

In [91]:
data[(data.abs() >3).any(axis='columns')]

            0         1         2         3
185 -0.855494  0.387373  3.307190 -0.701852
275 -3.222218  1.052052  1.448954 -1.634147
311 -0.000444 -0.042453  0.835178  3.051162
457 -0.131420 -0.532407  0.588435 -3.382357
493 -0.367413  3.335903  1.888529 -0.476697
524 -1.459795  1.236586 -3.088291 -0.922157
528 -0.015051  0.423800 -0.206620  3.087162
610  0.726964  0.159440 -3.077630  1.732655
762 -3.299076  0.225218 -0.423924  0.222791
815 -3.146020 -0.223873 -1.563511 -0.362034
816 -0.819777  0.465547  3.072759  0.174257
851 -1.342730 -0.039869  0.638403 -3.818862
905 -3.172474  1.533277  0.033092 -1.360118

设置`[-3,3]`的 cap values

In [ ]:
data[data.abs()>3] = np.sign(data) * 3 # -3 or 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.004340     0.007641    -0.001007    -0.101029
std       0.991564     0.983681     1.005702     0.998900
min      -3.000000    -2.845783    -3.000000    -3.000000
25%      -0.664155    -0.657660    -0.660373    -0.783746
50%       0.015988     0.021432     0.012209    -0.110061
75%       0.624453     0.659387     0.680037     0.553247
max       2.902788     3.000000     3.000000     3.000000

语句 `np.sign（data）` 根据数据的符号（sign）是正的 or 负的 or 0，会产生 1 和 –1 和 0 的值：

In [94]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1 -1.0  1.0 -1.0  1.0
2  1.0 -1.0 -1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0  1.0 -1.0 -1.0

## 随机排列与抽样 Permutation and Random Sampling

In [95]:
df = pd.DataFrame(np.arange(5*7).reshape(5,7))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [ ]:
sampler = rng.permutation(5) # 5 以内的数随机排序
sampler

array([4, 3, 0, 2, 1])

In [ ]:
df.take(sampler) # 根据 sampler 随机数排序 index
# 创建一个copy

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13

In [ ]:
df.iloc[sampler] # 等效 .take

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [103]:
col_sampler = rng.permutation(7)

col_sampler

array([6, 3, 0, 4, 5, 1, 2])

In [ ]:
df.take(col_sampler, axis='columns') # 对 columns 采用 col_sampler

    6   3   0   4   5   1   2
0   6   3   0   4   5   1   2
1  13  10   7  11  12   8   9
2  20  17  14  18  19  15  16
3  27  24  21  25  26  22  23
4  34  31  28  32  33  29  30

抽样一个不重复的随机子集

In [107]:
df.sample(n=3)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

抽样一个可重复的子集 `replace = true`

In [109]:
df.sample(n=10, replace=True)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
3  21  22  23  24  25  26  27
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
1   7   8   9  10  11  12  13

In [108]:
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10, replace=True)

2   -1
0    5
3    6
1    7
4    4
1    7
1    7
2   -1
1    7
0    5
dtype: int64

## 指示/虚拟变量 Computing Indicator/Dummy Variables

  核心思想: <br>将分类变量（categorical variable）
  转换为二进制（0/1）数值矩阵，使分类数据能够被数学模型（如回归、机器学习）处理。

  错误做法（序数编码）：  
   1 # 将分类直接映射为1,2,3...会导致模型误解  
   `2 df['city'] = df['city'].map({'北京': 1, '上海': 2, '广州': 3})`  
   3 # 问题：模型会认为"广州 > 上海 > 北京"（数值大小关系），但这毫无意义！

  正确做法（虚拟变量）：  
   1 # 创建独立的二进制列  
   `2 city_dummies = pd.get_dummies(df['city'], prefix='city')`  
   3 # 结果：city_北京, city_上海, city_广州 三列，每列值为0或1

In [110]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [111]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [112]:
pd.get_dummies(df['key'], dtype = 'float')

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

在 DataFrame 的列名显示前缀 `prefix`

In [ ]:
dummies = pd.get_dummies(df['key'], prefix='key', dtype=float)
df_with_dummies = df[['data1']].join(dummies)

df_with_dummies

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

关于为什么 `df[['data1']].join(dummies)` 要使用 `[[‘data1’]]`  

`df[[]]` 用于选择多列，返回 DataFrame  
=> `df[['a', 'b']]` ✅  
=> `df['a'. 'b']` ❌

In [ ]:
print(df['data1'])
print(df['data1'].shape) # shape 是 Series，没有 .join(), .merge(), .groupby(), .pivot_table()..语法
print('-'*10)
print(df[['data1',]])
print(df[['data1',]].shape)  # shape 是 dataframe
print(df['data1', 'key'])  # 报错

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64
(6,)
----------
   data1
0      0
1      1
2      2
3      3
4      4
5      5
(6, 1)

KeyError: ('data1', 'key')

如果 DataFrame 中的一行属于多个类别，我们必须采用不同的方法来创建虚拟变量。  
例如： `‘Animation|Children's|Comedy’`

In [115]:
mnames = ["movie_id", "title", "genres"]

movies = pd.read_table("/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/datasets/movielens/movies.dat", 
                       sep="::", header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [126]:
dummies = movies['genres'].str.get_dummies(sep='|')
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [129]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [ ]:
print(movies_windic.iloc[0].shape) # Series
print(movies_windic.iloc[:1].shape) # DataFrame

(21,)
(1, 21)

统计应用的一个有用方法是与像 `pandas.cut` 这样的离散化函数结合：`pandas.get_dummies`

In [132]:
values = rng.uniform(size = 10)
values

array([0.1739597 , 0.83969022, 0.00684553, 0.99508031, 0.82839214,
       0.14535541, 0.21308321, 0.64045931, 0.06399299, 0.06252062])

In [ ]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.cut(values, bins)

[(0.0, 0.2], (0.8, 1.0], (0.0, 0.2], (0.8, 1.0], (0.8, 1.0], (0.0, 0.2], (0.2, 0.4], (0.6, 0.8], (0.0, 0.2], (0.0, 0.2]]
Categories (5, interval[float64, right]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [136]:
pd.get_dummies(pd.cut(values, bins), dtype=int)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           1           0           0           0           0
1           0           0           0           0           1
2           1           0           0           0           0
3           0           0           0           0           1
4           0           0           0           0           1
5           1           0           0           0           0
6           0           1           0           0           0
7           0           0           0           1           0
8           1           0           0           0           0
9           1           0           0           0           0

# 7.3 扩展数据类型